Tekla.Structures.Model.CircleRebarGroup.CircleRebarGroupStirrupTypeEnum
The different stirrup types.

Tekla.Structures.Model.CircleRebarGroup.CircleRebarGroupStirrupTypeEnum.STIRRUP_TYPE_CIRCLE
The circle type of stirrup.

Tekla.Structures.Model.CircleRebarGroup.CircleRebarGroupStirrupTypeEnum.STIRRUP_TYPE_SPIRAL
The spiral type of stirrup.